<template><div><h1 id="前言" tabindex="-1"><a class="header-anchor" href="#前言"><span>前言</span></a></h1>
<p>我认为，所谓教育，相较于在课堂上把知识重复一边，教会学生怎么学才是更重要的，尤其是大学计算机的教育。</p>
<p>过去，大学是学习的圣地，这里汇集了海量的图书和学者，是距离科学前沿最近的地方；而在这个时代，知识的获取成本无限趋近于0，你几乎可以在互联网上找到任何你想要的东西，需要的仅仅只是一台能上网的终端。因此，你获取知识的途径根本不必来自课堂，课堂也教不会你ppt之外的东西。大学计算机学生应该学会的第一件事是：主动学习。</p>
<p>主动学习这个词对我们来说并不陌生，从小我们就被教育不要被老师推着学，要自己主动学。当然，这里的主动学就是主动刷题，主动背书，总之就是一切为了考试的主动行为.或许一部分人喜欢这样的方式：一切为了应试，为了通过分数得到更好的资源，获得更高的社会地位；但是对另一部分人来说，至少对我而言，这就是纯粹的折磨了。幸运的是，大学不必过得和高中一样，除了卷绩点还有很多条路，你可以渐渐发现自己的兴趣所在，当你为自己的兴趣投入时间和精力时，你会发现学习是一件非常有趣的事情。</p>
<p>令人遗憾的是学校的课程不足以展示计算机世界的广阔，也不会教你如何像一个开发者一样去学习，所以这篇文档应运而生，我们的野心是向你展示计算机世界的魅力，里面汇集了一些资源，希望能帮助你更好的学习计算机。</p>
<p>感谢以下参与者的贡献，如果你想参与编辑本项目，请查看<RouteLink to="/about.html">关于本项目</RouteLink>。</p>
<p><RouteLink to="/atfirst.html">下一章</RouteLink></p>
</div></template>


